OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
/******************************************************************************//**
 * @file     led_gen2_control.c
 * @version  V3.00
 * @brief    Control AP6112Y by using LLSI interface sample file.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (c) 2024 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <stdlib.h>
#include "NuMicro.h"
#include "led_control.h"
#include "led_gen2_control.h"

volatile uint8_t u8SettingFlag = 0;

void * const Gen2Mode_Function[LED_MODE_COUNT] = {FUNC_Off, FUNC_Static, FUNC_Breathing, FUNC_Strobe, FUNC_Cycling,
                                                  FUNC_Random, FUNC_Music, FUNC_Wave, FUNC_Spring, FUNC_Water,
                                                  FUNC_Rainbow};

/* Initial User LED Setting */
#define cUser_LED 144
#if((cUser_LED*3) > (LED_GEN2_MAX_LED_NUMBER*3 + LED_GEN2_MAX_STRIP_COUNT*3))
    #define LED_USER_LEN (cUser_LED*3)
#else
    #define LED_USER_LEN (LED_GEN2_MAX_LED_NUMBER*3 + LED_GEN2_MAX_STRIP_COUNT*3)
#endif
__attribute__((aligned (4))) uint8_t UserLEDData[LED_USER_LEN];
__attribute__((aligned (4))) volatile LED_Setting_T User_LEDSetting = {0, 0, 100, 1, 255, 0, 0, 0xFF, 0, Dir_Forward, Type_GRB,
                                                                       1, 1, 0, FUNC_Static, UserLEDData, 0, 0, 0, Music_POP, cUser_LED*3, 0, eColorRed, 0};

/* The all Gen2 strip setting of all port */
__attribute__((aligned (4))) volatile LED_Gen2_Setting_T LED_Gen2_Port_Setting[LED_GEN2_MAX_SUPPORT_PORT];
/* The setting of current Gen2 control port */
__attribute__((aligned (4))) volatile LED_Gen2_Ctrl_T Gen2_Ctrl;
/* Data */
/* Descriptor table */
#define LED_Gen2_PDMA_DESC_NUM    11    // Total dexcriptior table for single strip conctrol
/* 0: Set Setup_LLSI_PERIOD_DUTY to LLSI_PERIOD and LLSI_DUTY
   1: Set LLSI_PCNT
   2: Transfer Y_Cable data (Burst 3 words)
   3: Transfer Y_Cable data (Single 20 words)
   4: Set LLSI_PCNT
   5: Transfer command + ID data (Burst 3 words)
   6: Transfer command + ID data (Single 1 word)
   7: Set Data_LLSI_PERIOD_DUTY to LLSI_PERIOD and LLSI_DUTY
   8: Set LLSI_PCNT
   9: Transfer LED data (Burst 3 words)
   10: Transfer LED data (Single mode)
*/
volatile DSCT_T StripA_PDMA_DESC[LED_GEN2_MAX_STRIP_COUNT*LED_Gen2_PDMA_DESC_NUM];
volatile DSCT_T StripB_PDMA_DESC[LED_GEN2_MAX_STRIP_COUNT*LED_Gen2_PDMA_DESC_NUM];
volatile DSCT_T Fan1LED_PDMA_DESC[LED_GEN2_MAX_STRIP_COUNT*LED_Gen2_PDMA_DESC_NUM];
volatile DSCT_T Fan2LED_PDMA_DESC[LED_GEN2_MAX_STRIP_COUNT*LED_Gen2_PDMA_DESC_NUM];
volatile DSCT_T Fan3LED_PDMA_DESC[LED_GEN2_MAX_STRIP_COUNT*LED_Gen2_PDMA_DESC_NUM];
volatile DSCT_T Fan4LED_PDMA_DESC[LED_GEN2_MAX_STRIP_COUNT*LED_Gen2_PDMA_DESC_NUM];
volatile DSCT_T* LED_Gen2_PDMA_DESC[LED_GEN2_MAX_SUPPORT_PORT] = 
{StripA_PDMA_DESC, StripB_PDMA_DESC,
 Fan1LED_PDMA_DESC, Fan2LED_PDMA_DESC,
 Fan3LED_PDMA_DESC, Fan4LED_PDMA_DESC,
};

/* LED strip detect */
volatile uint8_t *LED_Gen2_ACK_Width;
volatile uint32_t LED_Gen2_ACK_Count = 0;
volatile uint8_t LED_Gen2_ACK_Done_Flag = 0;
volatile uint8_t LED_Gen2_One_ACK_Flag = 0;
volatile uint32_t Total_LED_Gen2_Num;

/* LED setting */
#define LED_Gen2_Setting_Default 0xC00000
#define BLUE_DIMMING_Pos   0
#define RED_DIMMING_Pos    8
#define SEL_CUR_Pos        13
#define SEL_LED_CUR        0x0
#define SEL_LED_ID         0x1
#define REFRESH_Pos        15
#define GREEN_DIMMING_Pos  16
#define PWM_FREQ_Pos       22
#define PWM_FREQ_1250      0x0
#define PWM_FREQ_2500      0x1
#define PWM_FREQ_5000      0x2
#define PWM_FREQ_10000     0x3

/* Static Y cable mode data */
#define PIX_Y_CABLE_RESET    25    // 250 us
#define PIX_Y_CABLE_H        4     // 40  us
#define PIX_Y_CABLE_L        1     // 10  us
#define PIX_Y_CABLE          (PIX_Y_CABLE_RESET + PIX_Y_CABLE_H + PIX_Y_CABLE_L)
#define PIX_COMMAND_ID       1     //
#define PIX_CONTROL_CMD      (PIX_Y_CABLE + PIX_COMMAND_ID)
const uint32_t Pix_Y_Cable      = PIX_Y_CABLE;
const uint32_t Pix_Command_ID   = PIX_COMMAND_ID;
const uint32_t Pix_Control_Cmd  = PIX_CONTROL_CMD;
#define BYTE_Y_CABLE         (PIX_Y_CABLE * 3)
#define BYTE_COMMAND_ID      (PIX_COMMAND_ID * 3)
#define BYTE_CONTROL_CMD     (PIX_CONTROL_CMD * 3)
const uint32_t Byte_Y_Cable     = BYTE_Y_CABLE;
const uint32_t Byte_Command_ID  = BYTE_COMMAND_ID;
const uint32_t Byte_Control_Cmd = BYTE_CONTROL_CMD;
#if(BYTE_Y_CABLE%4)
    #define WORD_Y_CABLE     (BYTE_Y_CABLE/4+1)
#else
    #define WORD_Y_CABLE     BYTE_Y_CABLE/4
#endif
#if(BYTE_COMMAND_ID%4)
    #define WORD_COMMAND_ID  (BYTE_COMMAND_ID/4+1)
#else
    #define WORD_COMMAND_ID  BYTE_COMMAND_ID/4
#endif
#if(BYTE_CONTROL_CMD%4)
    #define WORD_CONTROL_CMD (BYTE_CONTROL_CMD/4+1)
#else
    #define WORD_CONTROL_CMD BYTE_CONTROL_CMD/4
#endif
const uint32_t Word_Y_Cable     = WORD_Y_CABLE;
const uint32_t Word_Command_ID  = WORD_COMMAND_ID;
const uint32_t Word_Control_Cmd = WORD_CONTROL_CMD;
const __attribute__((aligned (4))) uint8_t Data_Y_Cable[WORD_Y_CABLE*4] =
{
    /* 250 us (L) Reset */
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00,
    /* 40 us (H) */
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    0xFF, 0xFF,
    /* 10 us (L) */
    0x00, 0x00, 0x00,
    /* Dummy to align word */
    0x00, 0x00,
};

/* Setting for Gen2 control command */
#define Setup_Period  (HCLK_CLK / 1000000 * 10 / 24)          // HCLK * (10 us / 24 bits)
#define Setup_T1H     ((HCLK_CLK / 1000000 * 10 / 24) << 16)  // HCLK * (10 us / 24 bits)
const uint32_t Setup_LLSI_PERIOD_DUTY[2] = {Setup_Period, Setup_T1H};

#define Data_Period   (HCLK_CLK / 1000000 * 12 / 10)          // HCLK * 1.2 us
#define Data_T1H      ((HCLK_CLK / 1000000 * 9 / 10) << 16)   // HCLK * 0.9 us
#define Data_T0H      ((HCLK_CLK / 1000000 * 3 / 10) << 0)    // HCLK * 0.3 us
const uint32_t Data_LLSI_PERIOD_DUTY[2] = {Data_Period, (Data_T1H | Data_T0H)};

const uint8_t g_u8LLSI_Output_Low  = 0x00;
const uint8_t g_u8LLSI_Output_High = 0xFF;
enum Y_CABLE_CMD
{
    CMD_SET_ID = 0x01,
    CMD_CLEAN_ID,
    CMD_CHECK_ID,
    CMD_SPECIFY_ID,
};
#define REMAP_COMMAND_ID_BYTER(command, id) (((id & 0xF00) >> 8) | ((command &0x00F) << 4))
#define REMAP_COMMAND_ID_BYTEG(command, id) ((command & 0xFF0) >> 4)
#define REMAP_COMMAND_ID_BYTEB(command, id) (id & 0x0FF)
__attribute__((aligned (4))) uint8_t Data_CMD_ID[WORD_COMMAND_ID*4];
uint16_t LLSI_Command_ID[16] =
{
    0x924,    //4'b0000 = 100100100100
    0x926,    //4'b0001 = 100100100110
    0x934,    //4'b0010 = 100100110100
    0x936,    //4'b0011 = 100100110110
    0x9A4,    //4'b0100 = 100110100100
    0x9A6,    //4'b0101 = 100110100110
    0x9B4,    //4'b0110 = 100110110100
    0x9B6,    //4'b0111 = 100110110110
    0xD24,    //4'b1000 = 110100100100
    0xD26,    //4'b1001 = 110100100110
    0xD34,    //4'b1010 = 110100110100
    0xD36,    //4'b1011 = 110100110110
    0xDA4,    //4'b1100 = 110110100100
    0xDA6,    //4'b1101 = 110110100110
    0xDB4,    //4'b1110 = 110110110100
    0xDB6,    //4'b1111 = 110110110110
};
#define PIX_COMMAND_ID_DUMMY  (PIX_COMMAND_ID + 4)
const uint32_t Pix_Command_ID_Dummy  = PIX_COMMAND_ID_DUMMY;
#define BYTE_COMMAND_ID_DUMMY (PIX_COMMAND_ID_DUMMY * 3)
const uint32_t Byte_Command_ID_Dummy = BYTE_COMMAND_ID_DUMMY;
#if(BYTE_COMMAND_ID_DUMMY%4)
    #define WORD_COMMAND_ID_DUMMY  (BYTE_COMMAND_ID_DUMMY/4+1)
#else
    #define WORD_COMMAND_ID_DUMMY  BYTE_COMMAND_ID_DUMMY/4
#endif
const uint32_t Word_Command_ID_Dummy  = WORD_COMMAND_ID_DUMMY;
const __attribute__((aligned (4))) uint8_t Data_Specify_ID_Dummy[16][WORD_COMMAND_ID_DUMMY*4] =
{
    {0x49, 0x9A, 0x24, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 0  & Dummy 0x00
    {0x49, 0x9A, 0x26, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 1  & Dummy 0x00
    {0x49, 0x9A, 0x34, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 2  & Dummy 0x00
    {0x49, 0x9A, 0x36, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 3  & Dummy 0x00
    {0x49, 0x9A, 0xA4, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 4  & Dummy 0x00
    {0x49, 0x9A, 0xA6, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 5  & Dummy 0x00
    {0x49, 0x9A, 0xB4, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 6  & Dummy 0x00
    {0x49, 0x9A, 0xB6, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 7  & Dummy 0x00
    {0x4D, 0x9A, 0x24, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 8  & Dummy 0x00
    {0x4D, 0x9A, 0x26, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 9  & Dummy 0x00
    {0x4D, 0x9A, 0x34, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 10 & Dummy 0x00
    {0x4D, 0x9A, 0x36, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 11 & Dummy 0x00
    {0x4D, 0x9A, 0xA4, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 12 & Dummy 0x00
    {0x4D, 0x9A, 0xA6, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 13 & Dummy 0x00
    {0x4D, 0x9A, 0xB4, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 14 & Dummy 0x00
    {0x4D, 0x9A, 0xB6, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},    // Specify + 15 & Dummy 0x00
};

/* Static Feedback mode data */
#define PIX_FEEDBACK_RESET  25    // 250 us
#define PIX_FEEDBACK_H1     2     // 20  us
#define PIX_FEEDBACK_L      1     // 10  us
#define PIX_FEEDBACK_H2     5     // 50  us
#define PIX_ENTER_FEEDBACK  (PIX_FEEDBACK_RESET + PIX_FEEDBACK_H1 + PIX_FEEDBACK_L + PIX_FEEDBACK_H2)
const uint32_t Pix_Enter_Feedback  = PIX_ENTER_FEEDBACK;
#define BYTE_ENTER_FEEDBACK (PIX_ENTER_FEEDBACK * 3)
const uint32_t Byte_Enter_Feedback = BYTE_ENTER_FEEDBACK;
#if(BYTE_ENTER_FEEDBACK%4)
    #define WORD_ENTER_FEEDBACK (BYTE_ENTER_FEEDBACK/4+1)
#else
    #define WORD_ENTER_FEEDBACK BYTE_ENTER_FEEDBACK/4
#endif
const uint32_t Word_Enter_Feedback = WORD_ENTER_FEEDBACK;
const __attribute__((aligned (4))) uint8_t Data_Enter_Feedback[WORD_ENTER_FEEDBACK*4] =
{
    /* 250 us (L) Reset */
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00,
    /* 20 us (H1) */
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    /* 10 us (L) */
    0x00, 0x00, 0x00,
    /* 50 us (H2) */
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    /* Dummy to align word */
    0xFF
};

/* Static TH20 mode data */
#define PIX_TH20_RESET1     25    // 250 us
#define PIX_TH20_H          2     // 20  us
#define PIX_TH20_RESET2     25    // 250 us
#define PIX_ENTER_TH20      (PIX_TH20_RESET1 + PIX_TH20_H + PIX_TH20_RESET2)
const uint32_t Pix_Enter_TH20  = PIX_ENTER_TH20;
#define BYTE_ENTER_TH20     (PIX_ENTER_TH20 * 3)
const uint32_t Byte_Enter_TH20 = BYTE_ENTER_TH20;
#if(BYTE_ENTER_TH20%4)
    #define WORD_ENTER_TH20 (BYTE_ENTER_TH20/4+1)
#else
    #define WORD_ENTER_TH20 BYTE_ENTER_TH20/4
#endif
const uint32_t Word_Enter_TH20 = WORD_ENTER_TH20;
const __attribute__((aligned (4))) uint8_t Data_Enter_TH20[WORD_ENTER_TH20*4] =
{
    /* 250 us (L) Reset1 */
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00,
    /* 20 us (H) */
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,
    /* 250 us (L) Reset1 */
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00
};

