OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
void Init_Gen2_LED_Capture()
{
    /* Set unused BPWM to count Gen2 LED feedback waveform length */
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Enable module clock */
    CLK_EnableModuleClock(CAPTURE_BPWM_MODULE);

    /* Lock protected registers */
    SYS_LockReg();

    /* Unit BPWM Counter = 1 us */
    BPWM_SET_PRESCALER(CAPTURE_BPWM, NULL, CAPTURE_BPWM_PRESCALER - 1);
    BPWM_EnablePeriodInt(CAPTURE_BPWM, (uint32_t)NULL, (uint32_t)NULL);
    NVIC_EnableIRQ(CAPTURE_BPWM_IRQN);

    /* Change interrupt priority to normal */
    NVIC_SetPriority(CAPTURE_BPWM_IRQN, INT_PRIORITY_NORMAL);
}

void CAPTURE_BPWM_HANDLER()
{
    BPWM_ClearPeriodIntFlag(CAPTURE_BPWM, (uint32_t)NULL);
    BPWM_ForceStop(CAPTURE_BPWM, (uint32_t)NULL);
    CAPTURE_BPWM->CNTCLR = BPWM_CNTCLR_CNTCLR0_Msk;

    LED_Gen2_ACK_Done_Flag = 1;
}

void LED_Gen2_Set_Ctrl_Setting(uint8_t target_port)
{
    /* Set configuration for current control target port */
    Gen2_Ctrl.Current_Port = target_port;
    Gen2_Ctrl.Control_Data = PDMA_Mapping[target_port]->LED_Data;
    Gen2_Ctrl.fPDMA_Done = &PDMA_Mapping[target_port]->fPDMA_Done;
    Gen2_Ctrl.PDMA_Number = target_port;
}

void LED_Gen2_Transfer_Data(uint8_t target_port)
{
    uint32_t i, j;
    uint32_t byte_size;
    uint32_t word_size;

    /* Clear PDMA flag */
    PDMA_Mapping[target_port]->fPDMA_Done = 0;

    for(i = 1, j= 0; i < (LED_Gen2_Port_Setting[target_port].Strip_Count + 1); i++, j++)
    {
        /* Set Setup_LLSI_PERIOD_DUTY to LLSI_PERIOD and LLSI_DUTY */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 0].CTL =
            ((2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_INC |
            PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 0].SA = (uint32_t)&Setup_LLSI_PERIOD_DUTY;
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 0].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->PERIOD;

        /* Set LLSI_PCNT */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 1].CTL =
            ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
            PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 1].SA = (uint32_t)&Pix_Y_Cable;
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 1].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->PCNT;

        /* Transfer Y_Cable data (Burst 3 words) */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 2].CTL =
            ((3 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
            PDMA_REQ_BURST | PDMA_BURST_4 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 2].SA = (uint32_t)&Data_Y_Cable;
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 2].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->DATA;

        /* Transfer Y_Cable data */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 3].CTL =
            ((WORD_Y_CABLE - 3 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
            PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 3].SA = (uint32_t)&Data_Y_Cable + 12;
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 3].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->DATA;

        /* Set LLSI_PCNT */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 4].CTL =
            ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
            PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 4].SA = (uint32_t)&Pix_Command_ID_Dummy;
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 4].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->PCNT;

        /* Transfer command + ID data (Burst 2 words) */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 5].CTL =
            ((2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
            PDMA_REQ_BURST | PDMA_BURST_2 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 5].SA = (uint32_t)&Data_Specify_ID_Dummy[i][0];
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 5].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->DATA;

        /* Transfer command + ID data (Single 2 words) */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 6].CTL =
            ((WORD_COMMAND_ID_DUMMY - 2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
            PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 6].SA = (uint32_t)&Data_Specify_ID_Dummy[i][0] + 8;
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 6].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->DATA;

        /* Set Data_LLSI_PERIOD_DUTY to LLSI_PERIOD and LLSI_DUTY */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 7].CTL =
            ((2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_INC |
            PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 7].SA = (uint32_t)&Data_LLSI_PERIOD_DUTY;
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 7].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->PERIOD;

