OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
        /* Set LLSI_PCNT */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 8].CTL =
            ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
            PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 8].SA = (uint32_t)&LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LED_Number;
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 8].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->PCNT;

        byte_size = LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LED_Number * 3;
        if(byte_size % 4)
            word_size = byte_size/4 + 1;
        else
            word_size = byte_size/4;

        /* Transfer LED data (Burst 3 words) */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 9].CTL =
            ((3 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
            PDMA_REQ_BURST | PDMA_BURST_4 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 9].SA = (uint32_t)(LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LED_Data + \
                                                                                      LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LED_Offset);
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM + 9].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->DATA;

        /* Transfer LED data (Single mode) */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM +10].CTL =
            ((word_size - 3 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
            PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
            PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
            PDMA_OP_SCATTER;
        /* Configure source address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM +10].SA = (uint32_t)(LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LED_Data + 12 + \
                                                                                      LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LED_Offset);
        /* Configure destination address */
        LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM +10].DA = (uint32_t)&LLSI_Port_Mapping[target_port]->DATA;
    }
    /* Change last descriptor to basic mode */
    LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM - 1].CTL 
        = (LED_Gen2_PDMA_DESC[target_port][j*LED_Gen2_PDMA_DESC_NUM - 1].CTL & ~PDMA_DSCT_CTL_OPMODE_Msk) | PDMA_OP_BASIC;

    /* Set LLSI interrupt count */
    LED_Gen2_Port_Setting[target_port].LLSI_INT_Count = 3 * i;

    /* Start LLSI PDMA transfer */
    PDMA_SetTransferMode(target_port, 36 + target_port, TRUE, (uint32_t)&LED_Gen2_PDMA_DESC[target_port][0]);    // PDMA_LLSI0 = 36
}

void LED_Gen2_Check_ACK(uint8_t one_ACK, uint32_t timeout_us)
{
    /* Change MFP to GPIO */
    *(uint32_t *)(SYS_BASE + LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_MFP_OFFSET) =
        (*(uint32_t *)(SYS_BASE + LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_MFP_OFFSET) & \
         (~LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_GPIO_MSK));

    /* Enable GPIO interrupt to get ACK pulse */
    GPIO_EnableInt(LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_Port,
                   LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_Number,
                   GPIO_INT_BOTH_EDGE);

    /* Change interrupt priority to highest */
    NVIC_SetPriority(LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_IRQn, INT_PRIORITY_HIGHEST);

    /* Set ACK Width Recoard Array */
    LED_Gen2_ACK_Width = Gen2_Ctrl.Control_Data;
    LED_Gen2_ACK_Count = 0;

    /* Wait for ACK pulse width */
    CAPTURE_BPWM->PERIOD = timeout_us;

    /* Start Timer */
    LED_Gen2_ACK_Done_Flag = 0;
    LED_Gen2_One_ACK_Flag = one_ACK;
    BPWM_Start(CAPTURE_BPWM, (uint32_t)NULL);
}

uint8_t LED_Gen2_Wait_ACK_Done(void)
{
    /* Check ACK done */
    if(LED_Gen2_ACK_Done_Flag)
    {
        LED_Gen2_ACK_Done_Flag = 0;

        /* Change interrupt priority to normal */
        NVIC_SetPriority(LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_IRQn, INT_PRIORITY_NORMAL);

        /* Change MFP to LLSI */
        *(uint32_t *)(SYS_BASE + LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_MFP_OFFSET) =
            (*(uint32_t *)(SYS_BASE + LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_MFP_OFFSET) & \
             (~LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_GPIO_MSK)) | \
            LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_LLSI_MSK;

        /* Disable GPIO Interrupt */
        GPIO_DisableInt(LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_Port,
                        LED_LLSI_IO_Setting[Gen2_Ctrl.Current_Port].IO_Number);

        return 1;
    }

    /* Not done yet */
    return 0;
}

void LED_Gen2_Control_CMD_ID(uint8_t cmd, uint8_t id)
{
    /* Clear PDMA flag */
    *Gen2_Ctrl.fPDMA_Done = 0;

    /* Set Setup_LLSI_PERIOD_DUTY to LLSI_PERIOD and LLSI_DUTY */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0].CTL =
        ((2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_INC |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0].SA = (uint32_t)&Setup_LLSI_PERIOD_DUTY;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PERIOD;

    /* Set LLSI_PCNT */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][1].CTL =
        ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][1].SA = (uint32_t)&Pix_Y_Cable;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][1].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PCNT;

