OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
    /* Set LLSI_PCNT */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][5].CTL =
        ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][5].SA = (uint32_t)&Pix_Enter_Feedback;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][5].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PCNT;

    /* Transfer Feedback_mode data */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][6].CTL =
        ((WORD_ENTER_FEEDBACK - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
        PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_BASIC;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][6].SA = (uint32_t)&Data_Enter_Feedback;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][6].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->DATA;

    /* Set LLSI interrupt count */
    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].LLSI_INT_Count = 2;

    /* Start LLSI PDMA transfer */
    PDMA_SetTransferMode(Gen2_Ctrl.Current_Port, 36 + Gen2_Ctrl.Current_Port, TRUE, (uint32_t)&LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0]);    // PDMA_LLSI0 = 36
    LLSI_SET_PDMA_MODE(LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]);

    /* Wait transfer done */
    while(*Gen2_Ctrl.fPDMA_Done == 0);

    /* Get all ACK, max width is 160 us */
    LED_Gen2_Check_ACK(0, 160);
}

void LED_Gen2_Set_SEL_CUR(uint8_t id, uint8_t sel_cur)
{
    uint32_t i;
    uint32_t setting;
    uint8_t setting_byte1, setting_byte2, setting_byte3;

    /* Clear PDMA flag */
    *Gen2_Ctrl.fPDMA_Done = 0;

    /* Set Setup_LLSI_PERIOD_DUTY to LLSI_PERIOD and LLSI_DUTY */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0].CTL =
        ((2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_INC |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0].SA = (uint32_t)&Setup_LLSI_PERIOD_DUTY;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PERIOD;

    /* Set LLSI_PCNT */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][1].CTL =
        ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][1].SA = (uint32_t)&Pix_Y_Cable;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][1].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PCNT;

    /* Transfer Y_Cable data */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][2].CTL =
        ((WORD_Y_CABLE - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
        PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][2].SA = (uint32_t)&Data_Y_Cable;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][2].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->DATA;

    /* Set LLSI_PCNT */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][3].CTL =
        ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][3].SA = (uint32_t)&Pix_Command_ID;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][3].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PCNT;

    /* Command + ID */
    Data_CMD_ID[0] = REMAP_COMMAND_ID_BYTER(LLSI_Command_ID[CMD_SPECIFY_ID], LLSI_Command_ID[id]);
    Data_CMD_ID[1] = REMAP_COMMAND_ID_BYTEG(LLSI_Command_ID[CMD_SPECIFY_ID], LLSI_Command_ID[id]);
    Data_CMD_ID[2] = REMAP_COMMAND_ID_BYTEB(LLSI_Command_ID[CMD_SPECIFY_ID], LLSI_Command_ID[id]);

    /* Transfer command + ID data */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][4].CTL =
        ((WORD_COMMAND_ID - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
        PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][4].SA = (uint32_t)Data_CMD_ID;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][4].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->DATA;

    /* Set LLSI_PCNT */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][5].CTL =
        ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][5].SA = (uint32_t)&Pix_Enter_TH20;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][5].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PCNT;

    /* Transfer TH20_mode data */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][6].CTL =
        ((WORD_ENTER_TH20 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
        PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][6].SA = (uint32_t)&Data_Enter_TH20;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][6].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->DATA;

    /* Set Data_LLSI_PERIOD_FUTY to LLSI_PERIOD and LLSI_DUTY */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][7].CTL =
        ((2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_INC |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][7].SA = (uint32_t)&Data_LLSI_PERIOD_DUTY;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][7].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PERIOD;

