OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
    /* Set LLSI_PCNT */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][8].CTL =
        ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][8].SA = (uint32_t)&LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].LED_Gen2_Setting[id].LED_Number;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][8].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PCNT;

    /* Set SEL_CUR */
    setting = LED_Gen2_Setting_Default | \
              (0x1F << BLUE_DIMMING_Pos) |   // Blue Dimming
              (0x1F << RED_DIMMING_Pos) |    // Red Dimming
              (sel_cur << SEL_CUR_Pos) |     // SEL_CUR
              (0x1F << GREEN_DIMMING_Pos);   // Green Dimming
    setting_byte1 = (setting & 0x00FF00) >>  8;
    setting_byte2 = (setting & 0xFF0000) >> 16;
    setting_byte3 = (setting & 0x0000FF)      ;
    for(i = 0; i < LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].LED_Gen2_Setting[id].LED_Number; i++)
    {
        Gen2_Ctrl.Control_Data[i*3    ] = setting_byte1;
        Gen2_Ctrl.Control_Data[i*3 + 1] = setting_byte2;
        Gen2_Ctrl.Control_Data[i*3 + 2] = setting_byte3;
    }
    if(i*3%4)
        i = i*3/4 + 1;
    else
        i = i*3/4;

    /* Transfer SEL_CUR setting */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][9].CTL =
        ((i - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
        PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_BASIC;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][9].SA = (uint32_t)Gen2_Ctrl.Control_Data;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][9].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->DATA;

    /* Set LLSI interrupt count */
    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].LLSI_INT_Count = 3;

    /* Start LLSI PDMA transfer */
    PDMA_SetTransferMode(Gen2_Ctrl.Current_Port, 36 + Gen2_Ctrl.Current_Port, TRUE, (uint32_t)&LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0]);    // PDMA_LLSI0 = 36
    LLSI_SET_PDMA_MODE(LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]);
}

void LED_Gen2_Get_Feedback(uint8_t id)
{
    /* Clear PDMA flag */
    *Gen2_Ctrl.fPDMA_Done = 0;

    /* Set Setup_LLSI_PERIOD_DUTY to LLSI_PERIOD and LLSI_DUTY */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0].CTL =
        ((2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_INC |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0].SA = (uint32_t)&Setup_LLSI_PERIOD_DUTY;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PERIOD;

    /* Set LLSI_PCNT */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][1].CTL =
        ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][1].SA = (uint32_t)&Pix_Y_Cable;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][1].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PCNT;

    /* Transfer Y_Cable data */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][2].CTL =
        ((WORD_Y_CABLE - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
        PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][2].SA = (uint32_t)&Data_Y_Cable;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][2].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->DATA;

    /* Set LLSI_PCNT */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][3].CTL =
        ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][3].SA = (uint32_t)&Pix_Command_ID;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][3].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PCNT;

    /* Command + ID */
    Data_CMD_ID[0] = REMAP_COMMAND_ID_BYTER(LLSI_Command_ID[CMD_SPECIFY_ID], LLSI_Command_ID[id]);
    Data_CMD_ID[1] = REMAP_COMMAND_ID_BYTEG(LLSI_Command_ID[CMD_SPECIFY_ID], LLSI_Command_ID[id]);
    Data_CMD_ID[2] = REMAP_COMMAND_ID_BYTEB(LLSI_Command_ID[CMD_SPECIFY_ID], LLSI_Command_ID[id]);

    /* Transfer command + ID data */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][4].CTL =
        ((WORD_COMMAND_ID - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
        PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][4].SA = (uint32_t)Data_CMD_ID;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][4].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->DATA;

    /* Set LLSI_PCNT */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][5].CTL =
        ((1 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_FIX | PDMA_DAR_FIX |
        PDMA_REQ_BURST | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_SCATTER;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][5].SA = (uint32_t)&Pix_Enter_Feedback;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][5].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->PCNT;

    /* Transfer Feedback_mode data */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][6].CTL =
        ((WORD_ENTER_FEEDBACK - 1) << PDMA_DSCT_CTL_TXCNT_Pos) |
        PDMA_WIDTH_32 | PDMA_SAR_INC | PDMA_DAR_FIX |
        PDMA_REQ_SINGLE | PDMA_BURST_128 | PDMA_TBINTDIS_DISABLE |
        PDMA_OP_BASIC;
    /* Configure source address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][6].SA = (uint32_t)&Data_Enter_Feedback;
    /* Configure destination address */
    LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][6].DA = (uint32_t)&LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]->DATA;

    /* Set LLSI interrupt count */
    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].LLSI_INT_Count = 2;

    /* Start LLSI PDMA transfer */
    PDMA_SetTransferMode(Gen2_Ctrl.Current_Port, 36 + Gen2_Ctrl.Current_Port, TRUE, (uint32_t)&LED_Gen2_PDMA_DESC[Gen2_Ctrl.Current_Port][0]);    // PDMA_LLSI0 = 36
    LLSI_SET_PDMA_MODE(LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]);

    /* Wait transfer done */
    while(*Gen2_Ctrl.fPDMA_Done == 0);

    /* Get all ACK, max width is 160 us */
    LED_Gen2_Check_ACK(0, 160);
}

uint32_t LED_Gen2_Merge_Fixed_ID(uint8_t id)
{
    uint32_t i;
    uint32_t strip_id = 0;

    /* Merge fixed ID of current strip */
    for(i = 0; (i < LED_Gen2_ACK_Count) && (i < 32); i++)
    {
        if(Gen2_Ctrl.Control_Data[i] > LED_GEN2_FIXED_ID_CODE_LENGTH)
        {
            /* Bit 1 */
            strip_id |= 0x1 << (31 - i);
        }
    }

    /* Return ID */
    return strip_id;
}

void LED_Gen2_Control_Port(void)
{
    switch(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status)
    {
        /* No action */
        case 0x00:
        {
            break;
        }
        /* Clean all dynamic ID */
        case 0x01:
        {
            /* Clean target ID */
            LED_Gen2_Control_CMD_ID(CMD_CLEAN_ID, 0x00);

