OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
            /* Change status to wait transfer done */
            LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x02;
        }
        /* Clear all LED data */
        case 0x02:
        {
            if(*Gen2_Ctrl.fPDMA_Done == 1)
            {
                /* Change LLSI and PDMA setting to transfer LED data */
                LLSI_Initial(Gen2_Ctrl.Current_Port);
                PDMA_Initial(Gen2_Ctrl.Current_Port);

                Clear_LED_Data(LED_Mapping[Gen2_Ctrl.Current_Port]);
                LLSI_SET_PDMA_MODE(LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]);

                /* Change status to wait transfer done */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x03;
            }

            break;
        }
        /* Wait transfer done */
        case 0x03:
        {
            if(*Gen2_Ctrl.fPDMA_Done == 1)
            {
                /* Change LLSI and PDMA setting for LED Gen2 control */
                LED_Gen2_LLSI_PDMA_Init(Gen2_Ctrl.Current_Port);

                /* Initial to start set dynamic ID */
                /* Start from ID = 0x01 */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID = 1;

                /* Clear strip count */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count = 0;

                /* Change status to start set ID loop */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x04;
            }

            break;
        }
        /* Set dynamic ID */
        case 0x04:
        {
            /* Check strip count is not larger than 15 (max strip number in spec) */
            if(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count < 15)
            {
                /* Set target ID */
                LED_Gen2_Control_CMD_ID(CMD_SET_ID, LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID);

                /* Change status to wait ACK done */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x05;
            }
            else
            {
                /* Change status to check strip number */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x08;
            }

            break;
        }
        /* Wait Set ID ACK done */
        case 0x05:
        {
            if(LED_Gen2_Wait_ACK_Done() == 1)
            {
                /* Check ACK */
                if(LED_Gen2_ACK_Count == 0)
                {
                    /* No ACK, clear this dynamic ID */
                    LED_Gen2_Control_CMD_ID(CMD_CLEAN_ID, LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID);

                    /* Change status to wait transfer done */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x08;
                }
                else
                {
                    /* Check ID */
                    LED_Gen2_Control_CMD_ID(CMD_CHECK_ID, LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID);

                    /* Change status to wait ACK done */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x06;
                }
            }

            break;
        }
        /* Wait Check ID ACK done */
        case 0x06:
        {
            if(LED_Gen2_Wait_ACK_Done() == 1)
            {
                /* Check ACK */
                if(LED_Gen2_ACK_Count == 1)
                {
                    /* Add target ID */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID++;

                    /* Add strip count */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count++;

                    /* Change status to set next ID */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x04;
                }
                else
                {
                    /* Invalid, clean this dynamic ID */
                    LED_Gen2_Control_CMD_ID(CMD_CLEAN_ID, LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID);

                    /* Change status to wait transfer done */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x07;
                }
            }

            break;
        }
        /* Wait clean target ID transfer done to set target ID again*/
        case 0x07:
        {
            if(*Gen2_Ctrl.fPDMA_Done == 1)
            {
                /* Change status to set target ID again */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x04;
            }

            break;
        }
        /* Wait clean target ID transfer done to get LED number */
        case 0x08:
        {
            if(*Gen2_Ctrl.fPDMA_Done == 1)
            {
                if(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count > LED_GEN2_MAX_STRIP_COUNT)
                {
                    /* Disable LED Gen2 control */
                    LED_Gen2_Enable_Control(Gen2_Ctrl.Current_Port, FALSE);

                    /* Clear detected strip count */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count = 0;

                    /* Change status to finish detection */
                    /* Clear flag */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Flag = 0;

                    /* Change status to finish */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x00;
                }
                else
                {
                    /* Start from ID = 0x01 */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID = 1;

                    /* Change status to get LED number */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x09;

                    /* Clear total LED number count */
                    Total_LED_Gen2_Num = 0;
                }
            }

            break;
        }
        /* Get LED number of each strip */
        case 0x09:
        {
            /* Check target ID is not larger than strip count */
            if(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID  < (LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count + 1))
            {
                /* Get LED number of target ID strip */
                LED_Gen2_Get_LED_Number(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID);

