OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
                /* Change status to wait ACK done */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x0A;
            }
            else
            {
                /* Change status to get fixed ID of each strip */
                /* Start from ID = 0x01 */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID = 1;

                /* Change status to get fixed ID of each strip */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x0B;
            }

            break;
        }
        /* Wait Get_LED_Number ACK done */
        case 0x0A:
        {
            if(LED_Gen2_Wait_ACK_Done() == 1)
            {
                /* Check LED_Gen2_ACK_Count, the total max value is LED_GEN2_MAX_LED_NUMBER */
                if((Total_LED_Gen2_Num + LED_Gen2_ACK_Count) > LED_GEN2_MAX_LED_NUMBER)
                {
                    /* Disable LED Gen2 control */
                    LED_Gen2_Enable_Control(Gen2_Ctrl.Current_Port, FALSE);
                    /* Clear detected strip count */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count = 0;

                    /* Change status to finish detection */
                    /* Clear flag */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Flag = 0;

                    /* Change status to finish */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x00;
                }
                else
                {
                    /* Get LED number */
                    LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].LED_Gen2_Setting[LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID].LED_Number = LED_Gen2_ACK_Count;

                    /* Add total LED numbre */
                    Total_LED_Gen2_Num += LED_Gen2_ACK_Count;
                }

                /* Add target ID */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID++;

                /* Change status to get LED number of next ID strip */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x09;
            }

            break;
        }
        /* Get fixed ID of each strip */
        case 0x0B:
        {
            /* Check target ID is not larger than strip count */
            if(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID < (LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count + 1))
            {
                /* Set SEL_CUR to SEL_LED_ID for feedback fixed ID */
                LED_Gen2_Set_SEL_CUR(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID, SEL_LED_ID);

                /* Change status to wait transfer done */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x0C;
            }
            else
            {
                /* Change status to finish detection */
                /* Clear flag */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Flag = 0;

                /* Change status to finish */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x00;

                /* Check detect result and get stored setting from default setting */
                if(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count != 0)
                {
                    uint8_t i;

                    /* Read out the setting from user setting */
                    for(i = 1; i < (LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count + 1); i++)
                    {
                        /* Find setting */
                        if(u8SettingFlag == 0xFF)
                            LED_Gen2_ReadStoredSetting(Gen2_Ctrl.Current_Port, i);
                        else
                            /* No exist setting, use default setting */
                            LED_Gen2_Default_Setting(Gen2_Ctrl.Current_Port, i);
                    }

                    /* Use_Gen2 */
                    /* Clear all ID if Use_Gen2 = 0 */
                    if(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Use_Gen2 == 0)
                    {
                        LED_Gen2_Control_CMD_ID(CMD_CLEAN_ID, 0x00);
                        while(*Gen2_Ctrl.fPDMA_Done == 0);

                        /* Clear LLSI interrupt count */
                        LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].LLSI_INT_Count = 0;

                        /* Initial target port */
                        LLSI_Initial(Gen2_Ctrl.Current_Port);
                        PDMA_Initial(Gen2_Ctrl.Current_Port);
                    }

                    /* Sort sequence number by fixed ID */
                    uint32_t left = 0;
                    uint32_t right = LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count - 1;
                    uint32_t shift = 0;
                    uint32_t Data_Pair[TOTAL_LED_AREA][2];
                    /* Initial sorting data */
                    uint32_t index;
                    for(index = 0; index < LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count; index++)
                    {
                        Data_Pair[index][0] = index+1;
                        Data_Pair[index][1] = LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].LED_Gen2_Setting[index+1].Fixed_ID;
                    }
                    uint32_t temp0, temp1;
                    while(left < right) {
                        for(index = left; index < right; index++)
                        {
                            if(Data_Pair[index][1] > Data_Pair[index+1][1])    // Swap larger ID to right
                            {
                                temp0 = Data_Pair[index][0];
                                temp1 = Data_Pair[index][1];
                                Data_Pair[index][0] = Data_Pair[index+1][0];
                                Data_Pair[index][1] = Data_Pair[index+1][1];
                                Data_Pair[index+1][0] = temp0;
                                Data_Pair[index+1][1] = temp1;
                                shift = index;
                            }
                        }
                        right = shift;
                        for(index = right; index > left; index--)
                        {
                            if(Data_Pair[index][1] < Data_Pair[index-1][1])    // Swap larger ID to right
                            {
                                temp0 = Data_Pair[index][0];
                                temp1 = Data_Pair[index][1];
                                Data_Pair[index][0] = Data_Pair[index-1][0];
                                Data_Pair[index][1] = Data_Pair[index-1][1];
                                Data_Pair[index-1][0] = temp0;
                                Data_Pair[index-1][1] = temp1;
                                shift = index;
                            }
                        }
                        left = shift;
                    }
                    for(index = 0; index < LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Strip_Count; index++)
                    {
                        LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].LED_Gen2_Setting[Data_Pair[index][0]].Sequence = index;
                    }
                }
            }

            break;
        }
        /* Wait Set_SEL_CUR transfer done */
        case 0x0C:
        {
            if(*Gen2_Ctrl.fPDMA_Done == 1)
            {
                /* Get feedback */
                LED_Gen2_Get_Feedback(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID);

