OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
                /* Change status to wait ACK done */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x0D;
            }

            break;
        }
        /* Wait feedback mode ACK done */
        case 0x0D:
        {
            if(LED_Gen2_Wait_ACK_Done() == 1)
            {
                /* Get fixed ID from target strip  */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].LED_Gen2_Setting[LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID].Fixed_ID = LED_Gen2_Merge_Fixed_ID(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID);

                /* Set SEL_CUR to SEL_LED_CUR for feedback fixed ID */
                LED_Gen2_Set_SEL_CUR(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID, SEL_LED_CUR);

                /* Change status to wait transfer done */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x0E;
            }

            break;
        }
        /* Wait Set_SEL_CUR transfer done */
        case 0x0E:
        {
            if(*Gen2_Ctrl.fPDMA_Done == 1)
            {
                /* Add target ID */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_ID++;

                /* Change status to get fixed ID of next ID strip */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x0B;
            }

            break;
        }
        /* Clear LED data */
        case 0x20:
        {
            /* Clear LED data */
            if(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].ClearData_Flag == 1)
            {
                if(LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Use_Gen2 == TRUE)
                {
                    /* Clear LED Gen1 data */
                    LLSI_Initial(Gen2_Ctrl.Current_Port);
                    PDMA_Initial(Gen2_Ctrl.Current_Port);
                    Clear_LED_Data(LED_Mapping[Gen2_Ctrl.Current_Port]);
                    LLSI_SET_PDMA_MODE(LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]);
                }
                else
                {
                    /* Clear LED Gen2 data */
                    LED_Gen2_Disable_Mode(Gen2_Ctrl.Current_Port);
                    LLSI_SET_PDMA_MODE(LLSI_Port_Mapping[Gen2_Ctrl.Current_Port]);
                }

                /* Clear flag */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].ClearData_Flag = 0;
            }

            /* Change status to enable/disable target port control LED Gen2 */
            LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x21;
        }

        /* Change target port enable/disable Gen2 */
        case 0x21:
        {
            if(*Gen2_Ctrl.fPDMA_Done == 1)
            {
                /* Enable/Disable Gen2 */
                LED_Gen2_Enable_Control(Gen2_Ctrl.Current_Port, LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Use_Gen2);

                /* Change status to finish detection */
                /* Clear flag */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Flag = 0;

                /* Change status to finish */
                LED_Gen2_Port_Setting[Gen2_Ctrl.Current_Port].Control_Status = 0x00;
            }

            break;
        }
    }
}

void LED_Gen2_LLSI_PDMA_Init(uint8_t target_port)
{
    uint8_t i;

    /* Disable reset command function */
    LLSI_DISABLE_RESET_COMMAND(LLSI_Port_Mapping[target_port]);

    /* Change LLSI_PERIOD and LLSI_DUTY setting */
    LLSI_Port_Mapping[target_port]->PERIOD = Setup_LLSI_PERIOD_DUTY[0];
    LLSI_Port_Mapping[target_port]->DUTY = Setup_LLSI_PERIOD_DUTY[1];

    /* Disable reset command done interrupt */
    LLSI_DisableInt((LLSI_T *)LLSI_Port_Mapping[target_port], LLSI_FEND_INT_MASK);

    /* Enable frame done interrupt */
    LLSI_EnableInt((LLSI_T *)LLSI_Port_Mapping[target_port], LLSI_FEND_INT_MASK);

    /* Point to first PDMA descriptor */
    PDMA->DSCT[target_port].NEXT = (uint32_t)&LED_Gen2_PDMA_DESC[target_port][0] - (PDMA->SCATBA);

    /* Even descriptor table configuration */
    for(i = 0; i < (LED_GEN2_MAX_STRIP_COUNT*LED_Gen2_PDMA_DESC_NUM); i+=2)
        /* Configure next descriptor table address */
        LED_Gen2_PDMA_DESC[target_port][i].NEXT = (uint32_t)&LED_Gen2_PDMA_DESC[target_port][i+1] - (PDMA->SCATBA); /* next descriptor table is table i+1 */

    /* Odd descriptor table configuration */
    for(i = 1; i < (LED_GEN2_MAX_STRIP_COUNT*LED_Gen2_PDMA_DESC_NUM - 1); i+=2)
        /* Configure next descriptor table address */
        LED_Gen2_PDMA_DESC[target_port][i].NEXT = (uint32_t)&LED_Gen2_PDMA_DESC[target_port][i+1] - (PDMA->SCATBA); /* next descriptor table is table i+1 */

    /* Last descriptor table configuration */
    /* Configure next descriptor table address */
    LED_Gen2_PDMA_DESC[target_port][LED_GEN2_MAX_STRIP_COUNT*LED_Gen2_PDMA_DESC_NUM-1].NEXT = 0; /* No next operation table. No effect in basic mode */

    /* Change PDMA setting */
    PDMA_SetTransferMode(target_port, 36 + target_port, TRUE, 0);    // PDMA_LLSI0 = 36
    PDMA->DSCT[target_port].NEXT = (uint32_t)&LED_Gen2_PDMA_DESC[target_port][0] - (PDMA->SCATBA);

    /* Set GPIO to input mode */
    LED_LLSI_IO_Setting[target_port].IO_Port->SMTEN |= LED_LLSI_IO_Setting[target_port].IO_Bit;
    GPIO_SetMode(LED_LLSI_IO_Setting[target_port].IO_Port,
                 LED_LLSI_IO_Setting[target_port].IO_Bit,
                 GPIO_MODE_INPUT);

    /* Enable GPIO NVIC interrupt to get ACK pulse */
    NVIC_EnableIRQ(LED_LLSI_IO_Setting[target_port].IO_IRQn);

    /* Change interrupt priority to normal */
    NVIC_SetPriority(LED_LLSI_IO_Setting[target_port].IO_IRQn, INT_PRIORITY_NORMAL);
}

void LED_Gen2_Initial_Setting(uint8_t target_port)
{
    uint8_t i;

    /* Initial default setting */
    /* LED_Gen2_Setting_T */
    LED_Gen2_Port_Setting[target_port].Control_Flag = 0;
    LED_Gen2_Port_Setting[target_port].Control_Status = 0;
    LED_Gen2_Port_Setting[target_port].Control_ID = 0;
    LED_Gen2_Port_Setting[target_port].Strip_Count = 0;
    LED_Gen2_Port_Setting[target_port].Use_Gen2 = 0;
    LED_Gen2_Port_Setting[target_port].LLSI_INT_Count = 0;

    /* Initial offset start address */
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[0].LEDSetting.LED_Offset = 0;

