OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
    /* LED_Gen2_Strip_T */
    for(i = 1; i < (LED_GEN2_MAX_STRIP_COUNT + 1); i++)
    {
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].Fixed_ID = 0xFFFFFFFF;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LED_Number = 0;

        /* LED_Setting_T */
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.TimeCounter = 0;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.AP_Sync = 0;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LEDNum = LED_GEN2_DEFAULT_LED_NUMBER;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LightingMode = 0x0A;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Color_R = 255;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Color_G = 0;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Color_B = 0;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Brightness = 0xFF;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Speed = 0xD7;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Direction = Dir_Forward;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LED_Type = Type_GRB;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.fPDMA_Done = 1;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.RandomFlag = 1;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Random = 0;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Mode_FUNC = FUNC_Rainbow;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LED_Data = LED_Data_Array_Mapping[target_port];
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Main_Volume = 0;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Left_Volume = 0;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Right_Volume = 0;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Music_Action = Music_POP;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Array_Size = 
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LLSI_Num = target_port;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.ColorIndex = eColorRed;

        /* Offset */
        uint32_t byte_size = LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i-1].LEDSetting.LEDNum * 3;
        if(byte_size % 4)
            byte_size = (byte_size/4 + 1) * 4;
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LED_Offset = (LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i-1].LEDSetting.LED_Offset)
                                                                                       + byte_size;
    }
}

void LED_Gen2_Default_Setting(uint8_t target_port, uint8_t id)
{
    /* AP_Sync, LED_Nums, LightingMode */
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.AP_Sync = 0;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.LEDNum = LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LED_Number;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.LightingMode = 0x0A;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Mode_FUNC = FUNC_Rainbow;

    /* Color_R, Color_G, Color_B, Brightness */
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Color_R = 255;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Color_G = 0;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Color_B = 0;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Brightness = 0xFF;

    /* Speed, Direction, LED_Type */
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Speed = 0xD7;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Direction = Dir_Forward;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.LED_Type = Type_GRB;

    /* Offset */
    uint32_t byte_size = LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id-1].LEDSetting.LEDNum*3;
    if(byte_size%4)
        byte_size = (byte_size/4 + 1) * 4;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.LED_Offset = (LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id-1].LEDSetting.LED_Offset)
                                                                                    + byte_size;
}

void LED_Effect_Setting(uint8_t LightingMode, uint8_t Color_R, uint8_t Color_G, uint8_t Color_B, uint8_t Brightness)
{
    u8SettingFlag = 0xFF;

    /* LightingMode */
    User_LEDSetting.LightingMode = LightingMode;
    User_LEDSetting.Mode_FUNC = Gen2Mode_Function[User_LEDSetting.LightingMode];

    /* Color_R, Color_G, Color_B, Brightness */
    User_LEDSetting.Color_R = Color_R;
    User_LEDSetting.Color_G = Color_G;
    User_LEDSetting.Color_B = Color_B;
    User_LEDSetting.Brightness = Brightness;
}

void LED_Gen2_ReadStoredSetting(uint8_t target_port, uint8_t id)
{
    /* AP_Sync, LED_Nums, LightingMode */
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.AP_Sync = 0;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.LEDNum = LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LED_Number;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.LightingMode = User_LEDSetting.LightingMode;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Mode_FUNC = User_LEDSetting.Mode_FUNC;

    /* Color_R, Color_G, Color_B, Brightness */
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Color_R = User_LEDSetting.Color_R;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Color_G = User_LEDSetting.Color_G;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Color_B = User_LEDSetting.Color_B;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Brightness = User_LEDSetting.Brightness;

    /* Speed, Direction, LED_Type */
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Speed = 0xD7;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.Direction = Dir_Forward;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.LED_Type = Type_GRB;

