OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
    /* Offset */
    uint32_t byte_size = LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id-1].LEDSetting.LEDNum*3;
    if(byte_size%4)
        byte_size = (byte_size/4 + 1) * 4;
    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id].LEDSetting.LED_Offset = (LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[id-1].LEDSetting.LED_Offset)
                                                                                    + byte_size;
}

void LED_Gen2_Set_Setting(uint8_t target_port, uint8_t *setting)
{
    uint8_t i;
    uint8_t counter = 0;
    uint32_t id;

    do
    {
        /* Check fixed ID is valid nor not */
        id = (uint32_t)((setting[12 + 16*counter]      )|
                        (setting[13 + 16*counter] <<  8)|
                        (setting[14 + 16*counter] << 16)|
                        (setting[15 + 16*counter] << 24));
        if(id == 0xFFFFFFFF)
        {
            break;
        }
        else
        {
            /* Check fixed ID to current strip */
            for(i = 1; i < (LED_GEN2_MAX_STRIP_COUNT + 1); i++)
            {
                if(LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].Fixed_ID == id)
                {
                    /* LED_Nums, LED_Type, Direction, AP_Sync,  */
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LEDNum = (uint16_t)(setting[    16*counter] | setting[1 + 16*counter] << 8);
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LED_Type = setting[2 + 16*counter]; // Fixed GRB type in default
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Direction = setting[3 + 16*counter];
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.AP_Sync = setting[4 + 16*counter];

                    /* LightingMode, Color_R, Color_G, Color_B, Brightness, Speed */
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LightingMode = setting[5 + 16*counter];
                    if(LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LightingMode >= LED_MODE_COUNT)
                        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LightingMode = 0;
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Mode_FUNC = (LED_FUNC)Mode_Function[LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LightingMode];
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Color_R = setting[6 + 16*counter];
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Color_G = setting[7 + 16*counter];
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Color_B = setting[8 + 16*counter];
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Brightness = setting[9 + 16*counter];
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Speed = setting[10 + 16*counter];

                    /* Offset */
                    uint32_t byte_size = LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i-1].LEDSetting.LEDNum * 3;
                    if(byte_size % 4)
                        byte_size = (byte_size/4 + 1) * 4;
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.LED_Offset = (LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i-1].LEDSetting.LED_Offset)
                                                                                                   + byte_size;

                    /* Reset Timer */
                    LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.TimeCounter = 0;
                }
            }
        }
        counter++;
    } while(1);
}

void LED_Gen2_Control(uint8_t target_port)
{
    uint32_t i;

    /* Prepare data */
    for(i = 1; i < (LED_Gen2_Port_Setting[target_port].Strip_Count + 1); i++)
    {
        /* Calculate LED data */
        LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting.Mode_FUNC(&LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting);
    }

    /* Send out command and LED data */
    LED_Gen2_Transfer_Data(target_port);
}

void LED_Gen2_Disable_Mode(uint8_t target_port)
{
    uint32_t i;
    uint8_t* Control_Data;

    Control_Data = (uint8_t *)LED_Data_Array_Mapping[target_port];

    /* Prepare data */
    for(i = 1; i < (LED_Gen2_Port_Setting[target_port].Strip_Count + 1); i++)
        /* Calculate LED data */
        FUNC_Off(&LED_Gen2_Port_Setting[target_port].LED_Gen2_Setting[i].LEDSetting);

    /* Send out command and LED data */
    LED_Gen2_Transfer_Data(target_port);
}

void LED_Gen2_Enable_Control(uint8_t target_port, uint8_t enable)
{
    /* Enable LED Gen2 control */
    if(enable == TRUE)
    {
        if(LED_Gen2_Port_Setting[target_port].Strip_Count != 0)
        {
            /* Use LED Gen2 */
            LED_Gen2_Port_Setting[target_port].Use_Gen2 = TRUE;

            /* Initial LED Gen2 Setting */
            LED_Gen2_LLSI_PDMA_Init(target_port);
        }
        else
        {
            /* Disable LED Gen2 */
            LED_Gen2_Port_Setting[target_port].Use_Gen2 = FALSE;
        }
    }
    else
    {
        /* Use LED Gen1 */
        LED_Gen2_Port_Setting[target_port].Use_Gen2 = FALSE;

        /* Clean all ID */
        LED_Gen2_Set_Ctrl_Setting(target_port);
        LED_Gen2_Control_CMD_ID(CMD_CLEAN_ID, 0x00);
        while(*Gen2_Ctrl.fPDMA_Done == 0);

        /* Clear LLSI interrupt count */
        LED_Gen2_Port_Setting[target_port].LLSI_INT_Count = 0;

        /* Initial target port */
        LLSI_Initial(target_port);
        PDMA_Initial(target_port);
    }
}

void LED_Gen2_Capture_Rising(void)
{
    /* Get Pulse Response, Reset BPWM to Count Pulse Width */
    CAPTURE_BPWM->CNTCLR = BPWM_CNTCLR_CNTCLR0_Msk;
}

void LED_Gen2_Capture_Falling(void)
{
    /* Get BPWM Count */
    LED_Gen2_ACK_Width[LED_Gen2_ACK_Count++] = CAPTURE_BPWM->CNT & BPWM_CNT_CNT_Msk;

    if(LED_Gen2_One_ACK_Flag)
    {
        /* Stop BPWM */
        BPWM_ForceStop(CAPTURE_BPWM, (uint32_t)NULL);
        CAPTURE_BPWM->CNTCLR = BPWM_CNTCLR_CNTCLR0_Msk;
        LED_Gen2_ACK_Done_Flag = 1;
    }
    else
    {
        /* Reset BPWM */
        CAPTURE_BPWM->CNTCLR = BPWM_CNTCLR_CNTCLR0_Msk;
    }
}

void GPAB_IRQHandler(void)
{
    /* LLSI0 */
    if(GPIO_GET_INT_FLAG(LED_LLSI_IO_Setting[0].IO_Port, LED_LLSI_IO_Setting[0].IO_Bit))
    {
        GPIO_CLR_INT_FLAG(LED_LLSI_IO_Setting[0].IO_Port, LED_LLSI_IO_Setting[0].IO_Bit);
    
