OpenNuvoton/nuc1263bsp/Library/LlsiYcableLib/led_gen2_control.c
        /* Rising Edge Trigger */
        if(*((volatile uint32_t *)(GPIO_PIN_DATA_BASE + LED_LLSI_IO_Setting[0].IO_PDIO_OFFSET)))
            LED_Gen2_Capture_Rising();
        /* Falling Edge Trigger */
        else
            LED_Gen2_Capture_Falling();
    }

    /* LLSI1 */
    if(GPIO_GET_INT_FLAG(LED_LLSI_IO_Setting[1].IO_Port, LED_LLSI_IO_Setting[1].IO_Bit))
    {
        GPIO_CLR_INT_FLAG(LED_LLSI_IO_Setting[1].IO_Port, LED_LLSI_IO_Setting[1].IO_Bit);
    
        /* Rising Edge Trigger */
        if(*((volatile uint32_t *)(GPIO_PIN_DATA_BASE + LED_LLSI_IO_Setting[1].IO_PDIO_OFFSET)))
            LED_Gen2_Capture_Rising();
        /* Falling Edge Trigger */
        else
            LED_Gen2_Capture_Falling();
    }

    /* LLSI4 */
    if(GPIO_GET_INT_FLAG(LED_LLSI_IO_Setting[4].IO_Port, LED_LLSI_IO_Setting[4].IO_Bit))
    {
        GPIO_CLR_INT_FLAG(LED_LLSI_IO_Setting[4].IO_Port, LED_LLSI_IO_Setting[4].IO_Bit);
    
        /* Rising Edge Trigger */
        if(*((volatile uint32_t *)(GPIO_PIN_DATA_BASE + LED_LLSI_IO_Setting[4].IO_PDIO_OFFSET)))
            LED_Gen2_Capture_Rising();
        /* Falling Edge Trigger */
        else
            LED_Gen2_Capture_Falling();
    }

    /* LLSI5 */
    if(GPIO_GET_INT_FLAG(LED_LLSI_IO_Setting[5].IO_Port, LED_LLSI_IO_Setting[5].IO_Bit))
    {
        GPIO_CLR_INT_FLAG(LED_LLSI_IO_Setting[5].IO_Port, LED_LLSI_IO_Setting[5].IO_Bit);
    
        /* Rising Edge Trigger */
        if(*((volatile uint32_t *)(GPIO_PIN_DATA_BASE + LED_LLSI_IO_Setting[5].IO_PDIO_OFFSET)))
            LED_Gen2_Capture_Rising();
        /* Falling Edge Trigger */
        else
            LED_Gen2_Capture_Falling();
    }
}

void GPCDF_IRQHandler(void)
{
    /* LLSI2 */
    if(GPIO_GET_INT_FLAG(LED_LLSI_IO_Setting[2].IO_Port, LED_LLSI_IO_Setting[2].IO_Bit))
    {
        GPIO_CLR_INT_FLAG(LED_LLSI_IO_Setting[2].IO_Port, LED_LLSI_IO_Setting[2].IO_Bit);
    
        /* Rising Edge Trigger */
        if(*((volatile uint32_t *)(GPIO_PIN_DATA_BASE + LED_LLSI_IO_Setting[2].IO_PDIO_OFFSET)))
            LED_Gen2_Capture_Rising();
        /* Falling Edge Trigger */
        else
            LED_Gen2_Capture_Falling();
    }

    /* LLSI3 */
    if(GPIO_GET_INT_FLAG(LED_LLSI_IO_Setting[3].IO_Port, LED_LLSI_IO_Setting[3].IO_Bit))
    {
        GPIO_CLR_INT_FLAG(LED_LLSI_IO_Setting[3].IO_Port, LED_LLSI_IO_Setting[3].IO_Bit);
    
        /* Rising Edge Trigger */
        if(*((volatile uint32_t *)(GPIO_PIN_DATA_BASE + LED_LLSI_IO_Setting[3].IO_PDIO_OFFSET)))
            LED_Gen2_Capture_Rising();
        /* Falling Edge Trigger */
        else
            LED_Gen2_Capture_Falling();
    }
}
